renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdhi_rx/src/r_sdhi_util.c
/**********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2017(2019) Renesas Electronics Corporation. All rights reserved.
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdhi_util.c
* Version      : 2.06
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDHI API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 31.07.2017 2.00    First Release
*              : 20.05.2019 2.04    Added support for GNUC and ICCRX.
*                                   Fixed coding style. 
*              : 30.07.2019 2.05    Added  WAIT LOOP 
*              : 22.11.2019 2.06    Modified comment of API function to Doxygen style.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdhi_rx_if.h"
#include ".\src\r_sdhi_rx_private.h"

#ifdef SDHI_CFG_LONGQ_ENABLE                                /* Uses FIT LONGQ module                */
#include "r_longq_if.h"
#endif /* SDHI_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
#ifdef SDHI_CFG_LONGQ_ENABLE                                /* Uses FIT LONGQ module                */
static longq_hdl_t     p_sdhi_long_que = 0;                 /* LONGQ module                         */
#endif /* SDHI_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
 * Function Name: R_SDHI_SetClock
 *****************************************************************************************************************/ /**
 * @brief This function turns the SD clock on and off.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] div
 *             Use the following setting values:\n 
 *              High-speed mode: SDHI_CFG_DIV_HIGH_SPEED\n 
 *              Default-speed mode: SDHI_CFG_DIV_DEFAULT_SPEED\n 
 *              Card-recognition mode: SDHI_CFG_DIV_INIT_SPEED\n 
 *              Refer to 2.7 in application note, regarding the definitions of the above.
 * @param[in] enable
 *             Use the following setting values:\n 
 *              Clock stopped: SDHI_CLOCK_DISABLE\n 
 *              Clock supplied: SDHI_CLOCK_ENABLE
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Turns the SD clock on and off.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
sdhi_status_t R_SDHI_SetClock(uint32_t channel, uint32_t div, int32_t enable)
{
    sdhi_sdhndl_t   * p_hndl = 0;
    uint32_t            div_en = 0;
    int32_t             i = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }

    if ((SDHI_CLOCK_ENABLE != enable) && (SDHI_CLOCK_DISABLE != enable))
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    if ((SDHI_CLOCK_ENABLE == enable) && (r_sdhi_check_clksel(channel) == SDHI_ERR))
    {
        if (div >= SDHI_DIV_1)
        {
            SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
            return SDHI_ERR;
        }
    }
    /* WAIT_LOOP */
    for (i = 0; i < SDHI_SCLKDIVEN_LOOP_COUNT; i++)
    {
#ifdef USE_INFO2_CBSY
        if ((SDHI_INREG(p_hndl, SDHI_SDSTS2) & SDHI_SDIMSK2_CBSY) == 0)
        {
            break;
        }
#else
        if (SDHI_INREG(p_hndl, SDHI_SDSTS2) & SDHI_SDIMSK2_SCLKDIVEN)
        {
            break;
        }
#endif
    }

    if (SDHI_SCLKDIVEN_LOOP_COUNT == i)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        SDHI_OUTREG(p_hndl, SDHI_SDCLKCR, 0);       /* Halt */
        if (0 == SDHI_INREG(p_hndl, SDHI_SDCLKCR))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
        return SDHI_ERR;
    }

    if (SDHI_CLOCK_ENABLE == enable)
    {
        div_en = SDHI_INREG(p_hndl, SDHI_SDCLKCR);
        div_en = div_en & (~SDHI_CLOCK_MASK_SCLKEN);

        SDHI_OUTREG(p_hndl, SDHI_SDCLKCR, (uint32_t)div_en);
        if (SDHI_CLOCK_MASK_SCLKEN != SDHI_INREG(p_hndl, SDHI_SDCLKCR))
        {
            R_BSP_NOP();    /* Wait for the SDHI_CLOCK_MASK_SCLKEN Clear. */
        }

        if ((div == SDHI_DIV_1) || (div == SDHI_DIV_2))
        {
            /* Do nothing. */
        }
        else if (div >= SDHI_DIV_1)
        {
            div = SDHI_DIV_1;
        }
        else if (div >= SDHI_DIV_512)
        {
            div = SDHI_DIV_512;
        }
        else if (div >= SDHI_DIV_256)
        {
            div = SDHI_DIV_256;
        }
        else if (div >= SDHI_DIV_128)
        {
            div = SDHI_DIV_128;
        }
        else if (div >= SDHI_DIV_64)
        {
            div = SDHI_DIV_64;
        }
        else if (div >= SDHI_DIV_32)
        {
            div = SDHI_DIV_32;
        }
        else if (div >= SDHI_DIV_16)
        {
            div = SDHI_DIV_16;
        }
        else if (div >= SDHI_DIV_8)
        {
            div = SDHI_DIV_8;
        }
        else if (div >= SDHI_DIV_4)
        {
            div = SDHI_DIV_4;
        }
        else
        {
            /* Do nothing */
        }
        
