renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdhi_rx/src/r_sdhi_util.c
        SDHI_OUTREG(p_hndl, SDHI_SDCLKCR, (uint32_t)div);
        if (SDHI_CLOCK_MASK_SCLKEN != SDHI_INREG(p_hndl, SDHI_SDCLKCR))
        {
            R_BSP_NOP();    /* Wait for the SDHI_CLOCK_MASK_SCLKEN Clear. */
        }

        SDHI_OUTREG(p_hndl, SDHI_SDCLKCR, (uint32_t)(div | SDHI_CLOCK_MASK_SCLKEN));
        if (SDHI_CLOCK_MASK_SCLKEN == SDHI_INREG(p_hndl, SDHI_SDCLKCR))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }
    else
    {
        SDHI_OUTREG(p_hndl, SDHI_SDCLKCR, 0);       /* Halt */
        if (0 == SDHI_INREG(p_hndl, SDHI_SDCLKCR))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_SetClock() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_SetBus
 *****************************************************************************************************************/ /**
 * @brief This function makes SD bus settings.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] width
 *             Use the following setting values:\n 
 *              1-bit bus: SDHI_PORT_1BIT\n 
 *              4-bit bus: SDHI_PORT_4BIT
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Controls the SD bus width select bit (SDOPT.WIDTH) to set the SD bus to 1-bit or 4-bit operation.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            Do not call this function while a command sequence is running (SDSTS2.CBSY = 1).
 */
sdhi_status_t R_SDHI_SetBus(uint32_t channel, int32_t width)
{
    sdhi_sdhndl_t    * p_hndl = 0;
    uint32_t              reg = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }

    if ((SDHI_PORT_1BIT != width) && (SDHI_PORT_4BIT != width))
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ==== Change the SD bus width. ==== */
    if (SDHI_PORT_1BIT == width) /* 1bit */
    {
        reg = SDHI_INREG(p_hndl, SDHI_SDOPT);
        reg = (reg | SDHI_SDOPT_WIDTH);
        SDHI_OUTREG(p_hndl, SDHI_SDOPT, reg);
        if (SDHI_INREG(p_hndl, SDHI_SDOPT) == reg)
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }
    else    /* 4bits */
    {
        reg = SDHI_INREG(p_hndl, SDHI_SDOPT);
        reg = (reg & (~SDHI_SDOPT_WIDTH));
        SDHI_OUTREG(p_hndl, SDHI_SDOPT, reg);
        if (SDHI_INREG(p_hndl, SDHI_SDOPT) == reg)
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_SetBus() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_GetWP
 *****************************************************************************************************************/ /**
 * @brief This function gets the state of the SDHI_WP (SD write protect) pin.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[out] *p_wp
 *             Pointer to storage destination of SDHI_WP pin state \n 
 *              0: SDHI_WP pin level is high.\n 
 *              1: SDHI_WP pin level is low.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Gets the SDHI_WP pin state.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            To execute this function, the terminal setting processing of the SDHI_WP terminal is necessary. 
 *            For details, refer to section 4 in application note.
 */
sdhi_status_t R_SDHI_GetWP(uint32_t channel, uint32_t * p_wp)
{
    sdhi_sdhndl_t   * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }

    if (0 == p_wp)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /*  Check the SDHI_SDSTS1 WP bit.  */
    *p_wp = ((~SDHI_INREG(p_hndl, SDHI_SDSTS1)) & SDHI_SDSTS1_WP) >> SDHI_BIT_SHIFT_7;

    return SDHI_SUCCESS;
} /* End of function R_SDHI_GetWP() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_GetResp
 *****************************************************************************************************************/ /**
 * @brief This function gets the response from the SD card.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[out] *p_resp_reg
 *             Response register information structure\n 
 *              sdrsp10: Variable stored in response register 10\n 
 *              sdrsp32: Variable stored in response register 32\n 
 *              sdrsp54: Variable stored in response register 54\n 
 *              sdrsp76: Variable stored in response register 76
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Stores the values contained in the response registers (SDRSP10, SDRSP32, SDRSP54, and SDRSP76) 
 *            in the response register information structure. Divides and stores the contents of the response 
 *            among register sdrsp10, sdrsp32, sdrsp54, and sdrsp76, according to the response type. 
 *            Section 3.17 in application note shows the correspondence between the response register information
 *            structure and response storage destinations.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
sdhi_status_t R_SDHI_GetResp(uint32_t channel, sdhi_get_resp_t * p_resp_reg)
{
    sdhi_sdhndl_t * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }

    if (0 == p_resp_reg)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_resp_reg->sdrsp76 = SDHI_INREG(p_hndl, SDHI_SDRESP76);
    p_resp_reg->sdrsp54 = SDHI_INREG(p_hndl, SDHI_SDRESP54);
    p_resp_reg->sdrsp32 = SDHI_INREG(p_hndl, SDHI_SDRESP32);
    p_resp_reg->sdrsp10 = SDHI_INREG(p_hndl, SDHI_SDRESP10);

    return SDHI_SUCCESS;
} /* End of function R_SDHI_GetResp() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_GetBuffRegAddress
 *****************************************************************************************************************/ /**
 * @brief This function gets the address of the SD buffer register.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[out] *p_reg_buff
 *             Pointer to SD buffer register address
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Gets the SD buffer register address and stores it in the buffer.\n 
 *            Used for example when setting data register addresses to be used for DMAC or DTC transfers.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
sdhi_status_t R_SDHI_GetBuffRegAddress(uint32_t channel, uint32_t * p_reg_buff)
{
    sdhi_sdhndl_t  * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* Not initialized */
    }

    /*  Check the parameter.  */
    if (0 == p_reg_buff)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    *p_reg_buff = (uint32_t)(p_hndl->reg_base + SDHI_SDBUFR);

    return SDHI_SUCCESS;
} /* End of function R_SDHI_GetBuffRegAddress() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_OutReg
 *****************************************************************************************************************/ /**
 * @brief This function sets the SDHI registers.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] reg
 *             SDHI base register offset value. Refer to the table in section 3.18 in application note, 
 *             when setting macro definitions.
 * @param[in] data
 *             Register setting value
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Sets SDHI registers.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
sdhi_status_t R_SDHI_OutReg(uint32_t channel, uint32_t reg, uint32_t data)
{
    sdhi_sdhndl_t  * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* Not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    SDHI_OUTREG(p_hndl, reg, data);
    if (0 == SDHI_INREG(p_hndl, reg))
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_OutReg() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_InReg
 *****************************************************************************************************************/ /**
 * @brief This function gets the value of an SDHI register.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] reg
 *             SDHI base register offset value. Refer to the table in section 3.18 in application note, 
 *             when setting macro definitions.
 * @param[out] *p_data
 *             Pointer to storage destination of acquired register value
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Sets SDHI registers.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
sdhi_status_t R_SDHI_InReg(uint32_t channel, uint32_t reg, uint32_t * p_data)
{
    sdhi_sdhndl_t  * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;  /* Not initialized */
    }

    if (0 == p_data)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_UTIL, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

