renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdhi_rx/src/r_sdhi_util.c
    *p_data = SDHI_INREG(p_hndl, reg);
    
    return SDHI_SUCCESS;
} /* End of function R_SDHI_InReg() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_GetVersion
 *****************************************************************************************************************/ /**
 * @brief This function gets the driver version information.
 * @return    Upper 2 bytes: Major version (decimal notation).\n
 *            Lower 2 bytes: Minor version (decimal notation).
 * @details   Returns the driver version information.
 * @note      None.
 */
uint32_t  R_SDHI_GetVersion(void)
{
    uint32_t const version = ((RX_SDHI_VERSION_MAJOR << SDHI_BIT_SHIFT_16) | RX_SDHI_VERSION_MINOR);

    return version;
} /* End of function R_SDHI_GetVersion() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_SetLogHdlAddress
 *****************************************************************************************************************/ /**
 * @brief This function gets the handler address of the LONGQ FIT module.
 * @param[in] user_long_que
 *             LONGQ FIT module handler address
 * @retval    SDHI_SUCCESS Successful operation
 * @details   Sets the handler address of the LONGQ FIT module to point to the SDHI FIT module.
 * @note      Preparatory processing is performed to obtain error logs using the LONGQ FIT module. 
 *            Perform this processing before calling the R_SDHI_Open() function.\n 
 *            Add the separately available LONGQ FIT module to your project.\n
 *            If the SDHI_CFG_LONGQ_ENABLE disable and this function is called, this function does nothing.
 */
sdhi_status_t R_SDHI_SetLogHdlAddress(uint32_t user_long_que)
{
#ifdef SDHI_CFG_LONGQ_ENABLE
    p_sdhi_long_que = (longq_hdl_t)user_long_que;
#endif /* SDHI_CFG_LONGQ_ENABLE */

    return SDHI_SUCCESS;
} /* End of function R_SDHI_SetLogHdlAddress() */

#ifdef SDHI_CFG_LONGQ_ENABLE                                /* Uses FIT LONGQ module                */
/**********************************************************************************************************************
* Outline      : Store Debugging Information
* Function Name: r_sdhi_log
* Description  : Stores the debugging information.
* Arguments    : uint32_t           flg                  ;   Breakpoint processing
*              : uint32_t           fid                  ;   SDHI driver file No.
*              : uint32_t           line                 ;   SDHI driver line No.
* Return Value : 0      ; Successful
*              : 1      ; Error
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdhi_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err = LONGQ_SUCCESS;
    uint32_t    ul_tmp = 0;

    /* Long to Byte */
    ul_tmp = 0;                                                        /* sdhi_log   Reserved               */
    ul_tmp = (ul_tmp | (line << SDHI_BIT_SHIFT_8));                    /* sdhi_log   LINE                   */
    ul_tmp = (ul_tmp | (fid  << SDHI_BIT_SHIFT_21));                   /* sdhi_log   FID FILE No.           */
    ul_tmp = (ul_tmp | (SDHI_DRIVER_ID << SDHI_BIT_SHIFT_27));         /* sdhi_log   FID DRIVER No.         */
    ul_tmp = (ul_tmp | (flg  << SDHI_BIT_SHIFT_31));                   /* sdhi_log   Breakpoint processing  */

    /* error log white */
    err = R_LONGQ_Put(p_sdhi_long_que, ul_tmp);

    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }

    return 0;
} /* End of function r_sdhi_log() */
#endif /* SDHI_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
 * Function Name: R_SDHI_Log
 *****************************************************************************************************************/ /**
 * @brief This function gets the error log.
 * @param[in] flg
 *             0x00000001 (fixed value)
 * @param[in] fid
 *             0x0000003f (fixed value)
 * @param[in] line
 *             0x00001fff (fixed value)
 * @retval    0 Successful operation
 * @details   Gets the error log.\n 
 *            To end getting the error log, call the function.
 * @note      Use the debugging module.\n 
 *            Add the separately available LONGQ FIT module to your project.\n
 *            If the SDHI_CFG_LONGQ_ENABLE disable and this function is called, this function does nothing.
 */
uint32_t R_SDHI_Log(uint32_t flg, uint32_t fid, uint32_t line)
{
    SDHI_LOG_FUNC(flg, fid, line);
    return 0;
} /* End of function R_SDHI_Log() */

/* End of File */
